using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace BooksInformationSystem.Statics
{
    public class Configs
    {

        public string DataType = "XML Files (*.xml)|*.xml";

        public List<string> BookType = new List<string>
        {
            "Статья",
            "Книга",
            "Материал конференции",
            "Диссертация",
            "Отчёт",
            "Патент"
        };

        public List<string> BookContent = new List<string>
        {
            "00.00.00 Общественные науки в целом",
            "02.00.00 Философия",
            "03.00.00 История. Исторические науки",
            "04.00.00 Социология",
            "05.00.00 Демография",
            "06.00.00 Экономика. Экономические науки",
            "10.00.00 Государство и право. Юридические науки",
            "11.00.00 Политика. Политические науки",
            "12.00.00 Науковедение",
            "13.00.00 Культура. Культурология",
            "14.00.00 Народное образование. Педагогика",
            "15.00.00 Психология",
            "16.00.00 Языкознание",
            "17.00.00 Литература. Литературоведение.",
            "18.00.00 Искусство. Искусствоведение",
            "20.00.00 Информатика",
            "27.00.00 Математика",
            "28.00.00 Кибернетика",
            "29.00.00 Физика",
            "30.00.00 Механика",
            "31.00.00 Химия",
            "34.00.00 Биология",
            "43.00.00 Общие и комплексные проблемы естественных и точных наук",
            "45.00.00 Электротехника",
            "47.00.00 Электроника. Радиотехника",
            "59.00.00 Приборостроение",
            "67.00.00 Строительство. Архитектура",
        };

        public List<string> GridTitles = new List<string>
        {
            "ID",
            "Название",
            "Тип публикации",
            "Тематика",
            "Автор",
            "Год публикации",
            "Описание",
        };
    }
}
